; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	infrared1 - mode
	spectrograph0 - mode
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	GroundStation8 - direction
	GroundStation9 - direction
	GroundStation11 - direction
	GroundStation12 - direction
	Star14 - direction
	Star10 - direction
	GroundStation5 - direction
	Star13 - direction
	GroundStation0 - direction
	GroundStation7 - direction
	Star6 - direction
	Star15 - direction
	Planet16 - direction
	Star17 - direction
	Planet18 - direction
	Phenomenon19 - direction
	Phenomenon20 - direction
	Planet21 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 infrared1)
	(calibration_target instrument0 GroundStation5)
	(calibration_target instrument0 Star13)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star17)
	(supports instrument1 spectrograph0)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star13)
	(calibration_target instrument1 Star6)
	(calibration_target instrument1 Star10)
	(supports instrument2 infrared1)
	(calibration_target instrument2 GroundStation0)
	(calibration_target instrument2 Star13)
	(calibration_target instrument2 Star6)
	(calibration_target instrument2 GroundStation5)
	(calibration_target instrument2 Star10)
	(supports instrument3 spectrograph0)
	(supports instrument3 infrared1)
	(calibration_target instrument3 Star6)
	(calibration_target instrument3 GroundStation7)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon19)
)
(:goal (and
	(pointing satellite1 Star6)
	(have_image Star15 spectrograph0)
	(have_image Planet16 spectrograph0)
	(have_image Planet18 infrared1)
	(have_image Phenomenon19 infrared1)
	(have_image Phenomenon20 spectrograph0)
	(have_image Planet21 infrared1)
))

)

; plan
1. (turn_to satellite1 star6 phenomenon19)
   deleted: (pointing satellite1 phenomenon19)
   added: (pointing satellite1 star6)
   goals met: 1 of 7
2. (turn_to satellite0 groundstation5 star17)
   deleted: (pointing satellite0 star17)
   added: (pointing satellite0 groundstation5)
   goals met: 1 of 7
3. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 7
4. (calibrate satellite0 instrument0 groundstation5)
   added: (calibrated instrument0)
   goals met: 1 of 7
5. (turn_to satellite0 phenomenon20 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 phenomenon20)
   goals met: 1 of 7
6. (take_image satellite0 phenomenon20 instrument0 spectrograph0)
   added: (have_image phenomenon20 spectrograph0)
   goals met: 2 of 7
7. (turn_to satellite0 phenomenon19 phenomenon20)
   deleted: (pointing satellite0 phenomenon20)
   added: (pointing satellite0 phenomenon19)
   goals met: 2 of 7
8. (take_image satellite0 phenomenon19 instrument0 infrared1)
   added: (have_image phenomenon19 infrared1)
   goals met: 3 of 7
9. (turn_to satellite0 planet16 phenomenon19)
   deleted: (pointing satellite0 phenomenon19)
   added: (pointing satellite0 planet16)
   goals met: 3 of 7
10. (take_image satellite0 planet16 instrument0 spectrograph0)
   added: (have_image planet16 spectrograph0)
   goals met: 4 of 7
11. (turn_to satellite0 planet18 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 planet18)
   goals met: 4 of 7
12. (take_image satellite0 planet18 instrument0 infrared1)
   added: (have_image planet18 infrared1)
   goals met: 5 of 7
13. (turn_to satellite0 planet21 planet18)
   deleted: (pointing satellite0 planet18)
   added: (pointing satellite0 planet21)
   goals met: 5 of 7
14. (take_image satellite0 planet21 instrument0 infrared1)
   added: (have_image planet21 infrared1)
   goals met: 6 of 7
15. (turn_to satellite0 star15 planet21)
   deleted: (pointing satellite0 planet21)
   added: (pointing satellite0 star15)
   goals met: 6 of 7
16. (take_image satellite0 star15 instrument0 spectrograph0)
   added: (have_image star15 spectrograph0)
   goals met: 7 of 7
